# OpeningPartiallyCutsHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpeningPartiallyCutsHost Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Opening partially cuts its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpeningPartiallyCutsHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpeningPartiallyCutsHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpeningPartiallyCutsHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace